{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "71c6fa4e",
   "metadata": {},
   "source": [
    "Вам нужно помочь секретарю автоматизировать работу. Для этого нужно написать программу, которая будет на основе хранимых данных исполнять пользовательские команды.\n",
    "\n",
    "**Исходные данные имеют следующую структуру:**"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7cf3680a",
   "metadata": {},
   "source": [
    "**Общие требования к программе:**\n",
    "\n",
    "код должен быть грамотно декомпозирован (каждая функция отвечает за свою конкретную задачу, дублирующийся функционал переиспользуется, а его код не повторяется);\n",
    "\n",
    "в коде отсутствуют глобальные переменные (за исключением documents и directories);\n",
    "\n",
    "пользовательский ввод обрабатывается в цикле while до тех пор, пока пользователь явно не завершит программу (вводом команды “q”)."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "421e2c08",
   "metadata": {},
   "source": [
    "## Task 1\n",
    "Пользователь по команде “p” может узнать владельца документа по его номеру\n",
    "\n",
    "Пример работы программы:\n",
    "\n",
    "Введите команду:\n",
    "p\n",
    "\n",
    "Введите номер документа:\n",
    "10006\n",
    "\n",
    "Результат:\n",
    "Владелец документа: Аристарх Павлов"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "539729cc",
   "metadata": {},
   "source": [
    "### Task 2\n",
    "Секретарь по команде “s” может по номеру документа узнать на какой полке он (документ) хранится/\n",
    "\n",
    "Пример работы программы: Введите команду: s\n",
    "\n",
    "Введите номер документа: 10006\n",
    "\n",
    "Результат: Документ хранится на полке: 2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "ee7b42d9",
   "metadata": {},
   "outputs": [],
   "source": [
    "# 1. перечень всех документов\n",
    "documents = [\n",
    " {'type': 'passport', 'number': '2207 876234', 'name': 'Василий Гупкин'},\n",
    " {'type': 'invoice', 'number': '11-2', 'name': 'Геннадий Покемонов'},\n",
    " {'type': 'insurance', 'number': '10006', 'name': 'Аристарх Павлов'}\n",
    "]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "d38d4d59",
   "metadata": {},
   "outputs": [],
   "source": [
    "# 2.перечень полок, на которых хранятся документы (если документ есть в documents, то он обязательно должен быть и в directories)\n",
    "directories = {\n",
    " '1': ['2207 876234', '11-2'],\n",
    " '2': ['10006'],\n",
    " '3': []\n",
    "}\n",
    "# Нужно добавить проверку, если документа нет в директории, то следует его туда добавить"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "a5b75eef",
   "metadata": {},
   "outputs": [],
   "source": [
    "# получение Имени Владельца\n",
    "def p() -> str:  \n",
    "    ui = str(input('Введите номер документа: '))\n",
    "    for record in documents:\n",
    "        if record['number'] == ui:\n",
    "            return'Владелец документа: ' + record['name']\n",
    "    return 'Владелец документа: владелец не найден'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "19322ad4",
   "metadata": {},
   "outputs": [],
   "source": [
    "# получение Номера Полки\n",
    "def s() -> str:\n",
    "    ui = str(input('Введите номер документа: '))\n",
    "    for shelf, documents in directories.items():\n",
    "        if ui in documents:\n",
    "            return 'Документ хранится на полке: ' + shelf\n",
    "    return 'Документ не найден'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "0c239bdb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите команду - p для получения имени владельца документа, s для получения номера полки: afasfa\n",
      "Введите команду - p для получения имени владельца документа, s для получения номера полки: p\n",
      "Введите номер документа: 11-2\n",
      "Владелец документа: Геннадий Покемонов\n",
      "Введите команду - p для получения имени владельца документа, s для получения номера полки: dsfa\n",
      "Введите команду - p для получения имени владельца документа, s для получения номера полки: q\n"
     ]
    }
   ],
   "source": [
    "def main() -> str:\n",
    "    commands = {'p': p , 's': s}\n",
    "    while True:\n",
    "        ui = str(input('Введите команду - p для получения имени владельца документа, s для получения номера полки: '))\n",
    "        if ui == 'q': # добавляет условие, при котором после ввода \"q\" цикл заканчивается\n",
    "            break\n",
    "        else:\n",
    "            for command in commands:\n",
    "                if command == ui:\n",
    "                    print(commands[ui]())\n",
    "\n",
    "if __name__ == '__main__':\n",
    "    main()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
